Revit 2027 API
ClosestPointsPairBetweenTwoCurves.XYZPointOnFirstCurve Property
 Point on the first curve in 3d coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ XYZPointOnFirstCurve { get; set; }
Public Property XYZPointOnFirstCurve As XYZ
	Get
	Set
public:
property XYZ^ XYZPointOnFirstCurve {
	XYZ^ get ();
	void set (XYZ^ value);
}
member XYZPointOnFirstCurve : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  The property has not been set by the method providing the result.
See Also
Reference
ClosestPointsPairBetweenTwoCurves Class
Autodesk.Revit.DB Namespace